#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infrastructure relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/devmastery/devmastery/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/devmastery/devmastery

To view this run in a browser, visit:
https://app.terraform.io/app/devmastery/base/runs/run-T8ynRdAg9zmgNDhq

Waiting for the plan to start...

Terraform v1.3.0
on linux_amd64
Initializing plugins and modules...
module.rds-aurora[0].data.aws_partition.current: Reading...
aws_db_parameter_group.postgresql14: Refreshing state... [id=dm-aurora-db-postgres-parameter-group]
aws_rds_cluster_parameter_group.postgresql14: Refreshing state... [id=dm-aurora-postgres-cluster-parameter-group]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-047cc163bc32f9c63]
module.rds-aurora[0].data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
data.aws_rds_engine_version.postgresql: Reading...
module.rds-aurora[0].data.aws_partition.current: Read complete after 0s [id=aws]
module.rds-aurora[0].data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
module.rds-aurora[0].aws_iam_role.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20230225200307833400000001]
module.rds-aurora[0].aws_iam_role_policy_attachment.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20230225200307833400000001-20230225200308352900000002]
data.aws_rds_engine_version.postgresql: Read complete after 1s [id=14.6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0c146abcf9be4e5cc]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a7713827cbd44342]
module.rds-aurora[0].aws_security_group.this[0]: Refreshing state... [id=sg-04905b235f678a468]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0aa6bd443aa98d474]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-01bc340a0b260a576]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-04a5def6c836870f2]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00946d27ed0da0428]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e924e4f34d74a84e]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-082f4b3fc14ac4ab5]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0134976a0271c4dbe]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-00254f2e894d49ae7]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0bd0aae47da69e7b2]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0aa6bd443aa98d4741080289494]
module.rds-aurora[0].aws_security_group_rule.cidr_ingress[0]: Refreshing state... [id=sgrule-3502655924]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-051dd6ea88a46ed93]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01a9581529b9c2e90]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a6cc174fba3ab2bd]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e9db314492e2d792]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=vpc-dev]
module.rds-aurora[0].aws_db_subnet_group.this[0]: Refreshing state... [id=dm-dev-aurorav2-1]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-02cbf108c39429be8]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-082f24e7b7c154465]
module.vpc.aws_route.database_internet_gateway[0]: Refreshing state... [id=r-rtb-0bd0aae47da69e7b21080289494]
module.rds-aurora[0].aws_rds_cluster.this[0]: Refreshing state... [id=dm-dev-aurorav2-1]
module.rds-aurora[0].aws_rds_cluster_instance.this["b"]: Refreshing state... [id=dm-dev-aurorav2-1-b]
module.rds-aurora[0].aws_rds_cluster_instance.this["a"]: Refreshing state... [id=dm-dev-aurorav2-1-a]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.rds-aurora[0].aws_rds_cluster_instance.this["a"] has changed
  ~ resource "aws_rds_cluster_instance" "this" {
        id                                    = "dm-dev-aurorav2-1-a"
      ~ monitoring_interval                   = 120 -> 60
        tags                                  = {
            "Environment"  = "dev"
            "Organization" = "DevMastery"
        }
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds-aurora[0].aws_rds_cluster_instance.this["b"] has changed
  ~ resource "aws_rds_cluster_instance" "this" {
        id                                    = "dm-dev-aurorav2-1-b"
      ~ monitoring_interval                   = 120 -> 60
        tags                                  = {
            "Environment"  = "dev"
            "Organization" = "DevMastery"
        }
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.newsletter_subscription_api_deployment will be created
  + resource "aws_api_gateway_deployment" "newsletter_subscription_api_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = {
          + "redeployment" = "c72ed8730833c6c1bd2d87caa4f13c340bcd0b44"
        }
    }

  # aws_api_gateway_rest_api.newsletter_subscription_api will be created
  + resource "aws_api_gateway_rest_api" "newsletter_subscription_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + body                         = <<-EOT
            openapi: 3.0.2
            info:
              title: Newsletter Subscription API
              version: 1.0.0
              description: An API to manage Newsletter Subscriptions
            paths:
              /newsletter-subscriptions:
                summary: Path used to manage the list of newslettersubscriptions.
                description: >-
                  The REST endpoint/path used to list and create zero or more `NewsletterSubscription` entities. 
                  This path contains a `GET` and `POST` operation to perform the list and create tasks,
                  respectively.
                get:
                  x-amazon-apigateway-integration:
                    responses:
                      default:
                        statusCode: "200"
                    passthroughBehavior: when_no_match
                    httpMethod: GET
                    type: aws_proxy
                  responses:
                    "200":
                      content:
                        application/json:
                          schema:
                            type: array
                            items:
                              $ref: "#/components/schemas/NewsletterSubscription"
                      description: Successful response - returns an array of `NewsletterSubscription` entities.
                  operationId: getNewsletterSubscriptions
                  summary: List All NewsletterSubscriptions
                  description: Gets a list of all `NewsletterSubscription` entities.
                post:
                  x-amazon-apigateway-integration:
                    responses:
                      default:
                        statusCode: "201"
                    passthroughBehavior: when_no_match
                    httpMethod: POST
                    type: aws_proxy
                  requestBody:
                    description: A new `NewsletterSubscription` to be created.
                    content:
                      application/json:
                        schema:
                          $ref: "#/components/schemas/NewsletterSubscription"
                    required: true
                  responses:
                    "201":
                      description: Successful response.
                  operationId: createNewsletterSubscription
                  summary: Create a NewsletterSubscription
                  description: Creates a new instance of a `NewsletterSubscription`.
              "/newsletter-subscriptions/{newsletterSubscriptionId}":
                summary: Path used to manage a single NewsletterSubscription.
                description: >-
                  The REST endpoint/path used to get, update, and delete single instances of an
                  `NewsletterSubscription`.  This path contains `GET`, `PUT`, and `DELETE` operations used to
                  perform the get, update, and delete tasks, respectively.
                get:
                  x-amazon-apigateway-integration:
                    responses:
                      default:
                        statusCode: "200"
                    passthroughBehavior: when_no_match
                    httpMethod: GET
                    type: aws_proxy
                  responses:
                    "200":
                      content:
                        application/json:
                          schema:
                            $ref: "#/components/schemas/NewsletterSubscription"
                      description: Successful response - returns a single `NewsletterSubscription`.
                  operationId: getNewsletterSubscription
                  summary: Get a NewsletterSubscription
                  description: Gets the details of a single instance of a `NewsletterSubscription`.
                put:
                  x-amazon-apigateway-integration:
                    responses:
                      default:
                        statusCode: "202"
                    passthroughBehavior: when_no_match
                    httpMethod: PUT
                    type: aws_proxy
                  requestBody:
                    description: Updated `NewsletterSubscription` information.
                    content:
                      application/json:
                        schema:
                          $ref: "#/components/schemas/NewsletterSubscription"
                    required: true
                  responses:
                    "202":
                      description: Successful response.
                  operationId: updateNewsletterSubscription
                  summary: Update a NewsletterSubscription
                  description: Updates an existing `NewsletterSubscription`.
                delete:
                  x-amazon-apigateway-integration:
                    responses:
                      default:
                        statusCode: "204"
                    passthroughBehavior: when_no_match
                    httpMethod: DELETE
                    type: aws_proxy
                  responses:
                    "204":
                      description: Successful response.
                  operationId: deleteNewsletterSubscription
                  summary: Delete a NewsletterSubscription
                  description: Deletes an existing `NewsletterSubscription`.
                parameters:
                  - examples:
                      UUID:
                        value: 76b02a81-f8a6-4d09-b19c-250336249f78
                    name: newsletterSubscriptionId
                    description: A unique identifier for a `NewsletterSubscription`.
                    schema:
                      type: string
                    in: path
                    required: true
            components:
              schemas:
                NewsletterSubscription:
                  title: Root Type for NewsletterSubscription
                  description: ""
                  required:
                    - emailAddress
                    - id
                    - informedConsent
                    - subscribedAt
                    - newsletterId
                    - firstName
                  type: object
                  properties:
                    id:
                      pattern: '^[0-9a-fA-F]{8}\b-[0-9a-fA-F]{4}\b-[0-9a-fA-F]{4}\b-[0-9a-fA-F]{4}\b-[0-9a-fA-F]{12}$'
                      type: string
                      example: 757f2ef1-08dd-4856-a375-22daf5beb19b
                    firstName:
                      minLength: 2
                      type: string
                      example: Aisha
                    emailAddress:
                      type: string
                      example: a.jones@abc.com
                    newsletterId:
                      pattern: '^[0-9a-fA-F]{8}\b-[0-9a-fA-F]{4}\b-[0-9a-fA-F]{4}\b-[0-9a-fA-F]{4}\b-[0-9a-fA-F]{12}$'
                      type: string
                      example: 66e4c6f6-3263-4fba-99a9-ff188c50befc
                    verifiedEmailAddress:
                      pattern: '[^@ \t\r\n]+@[^@ \t\r\n]+\.[^@ \t\r\n]+'
                      type: string
                      example: a.jones@abc.com
                    informedConsent:
                      pattern: '[^@ \t\r\n]+@[^@ \t\r\n]+\.[^@ \t\r\n]+'
                      type: string
                      example: I agree to receive emails from DevMastery.com
                    subscribedAt:
                      format: date-time
                      type: string
                      example: "2023-02-02T00:00:00Z"
                  example:
                    id: 757f2ef1-08dd-4856-a375-22daf5beb19b
                    firstName: Aisha
                    emailAddress: a.jones@abc.com
                    newsletterId: 66e4c6f6-3263-4fba-99a9-ff188c50befc
                    verifiedEmailAddress: a.jones@abc.com
                    informedConsent: I agree to receive emails from DevMastery.com
                    subscribedAt: "2023-02-02T00:00:00Z"
        EOT
      + created_date                 = (known after apply)
      + description                  = "A service for subscribing to newsletters"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "newsletter-subscription-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.newsletter_subscription_api_stage will be created
  + resource "aws_api_gateway_stage" "newsletter_subscription_api_stage" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "dev"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.


```
</details>
*Pushed by: @arcdev1, Action: `pull_request`*